In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from pandas import Series, DataFrame
from numpy.random import randn

In [3]:
ser=Series([1,2,3,4], index=['a', 'b', 'c', 'd'])
ser

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
ind=ser.index

In [6]:
ind[2]

'c'

In [7]:
ser[2]

3

In [8]:
print(ind[2], ser[2])

c 3

In [11]:
ser2=ser.reindex(['a', 'b','c','d','e','f'])
ser2

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
f    NaN
dtype: float64

In [14]:
ser3=ser2.reindex(['a', 'b','c','d','e','f', 'g'], fill_value=0)
ser3

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
f    NaN
g    0.0
dtype: float64

In [4]:
ser4=Series(['USA', 'Mexico', 'Canada'], index=[0,5,10])

In [5]:
ser4

0        USA
5     Mexico
10    Canada
dtype: object

In [8]:
ranger=range(15)
ser4=ser4.reindex(range(15), method='ffill')
ser4

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [12]:
los=DataFrame(randn(25).reshape(5,5), 
             index=['A', 'B', 'D', 'E', 'F'],
             columns=['d1', 'd2', 'd3','d4', 'd5'])
los

         d1        d2        d3        d4        d5
A -0.096182 -0.574119 -1.465177 -0.250620  0.710212
B  0.008275  0.388013  0.699990 -0.254444  0.376906
D -1.380627 -0.018422  0.317008  0.602329 -1.103871
E  1.690234  0.804410 -0.700898 -1.895134  1.894105
F -0.739872 -0.280826  0.815498 -0.816603 -0.494827

In [18]:
new_col=['d1', 'd2', 'd3','d4', 'd5', 'd6']
los.reindex(['A', 'B', 'C', 'D', 'E', 'F'], columns=new_col)

         d1        d2        d3        d4        d5  d6
A -0.096182 -0.574119 -1.465177 -0.250620  0.710212 NaN
B  0.008275  0.388013  0.699990 -0.254444  0.376906 NaN
C       NaN       NaN       NaN       NaN       NaN NaN
D -1.380627 -0.018422  0.317008  0.602329 -1.103871 NaN
E  1.690234  0.804410 -0.700898 -1.895134  1.894105 NaN
F -0.739872 -0.280826  0.815498 -0.816603 -0.494827 NaN

In [22]:
ser=Series(range(1,4), index=['a', 'b','c'])
ser

a    1
b    2
c    3
dtype: int64

In [25]:
ser.drop('b')

a    1
c    3
dtype: int64

In [26]:
dframe1 = DataFrame(np.arange(9).reshape((3, 3)),
                    index=['SF', 'LA', 'NY'],
                    columns=['pop', 'size', 'year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [27]:
dframe1.drop('year', axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

In [28]:
ser1=Series(np.arange(1,4), index=['a', 'b', 'c'])
ser1

a    1
b    2
c    3
dtype: int32

In [30]:
ser2=ser1*2
ser2

a    2
b    4
c    6
dtype: int32